app/views/tags/show.html.erb

<p> The associated Todos are </p>
<%  @tag.todos.each do |t| %>
---
SELECT "todos".* FROM "todos" INNER JOIN "tags_todos" ON "todos"."id" = "tags_todos"."todo_id" WHERE "tags_todos"."tag_id" = ?  [["tag_id", 5]]