app/views/todos/_item.html.erb


<% if todo.deleted_at.nil? %>
---
DELETE FROM "tags_todos";
DELETE FROM "todos";