app/views/todos/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "tags_todos" ON "tags"."id" = "tags_todos"."tag_id" WHERE "tags_todos"."todo_id" = ?  [["todo_id", 5]]
---
<p> The checked Tags are:</p>
<% @todo.tags.all.each do |t| %>