app/controllers/tags_controller.rb

  def create
    @tag = Tag.new(tag_params)
    if @tag.save
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "asdasdsd"], ["created_at", "2019-11-13 11:19:28.708929"], ["updated_at", "2019-11-13 11:19:28.708929"]]

  def update
    @tag = Tag.find(params[:id])
    if @tag.update(tag_params)
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "tags" SET "name" = ?, "updated_at" = ? WHERE "tags"."id" = ?  [["name", "Thick slices of French toast bread"], ["updated_at", "2019-11-13 06:47:38.606426"], ["id", 5]]