app/controllers/todos_controller.rb

  def edit
    #debugger
    @todo = Todo.with_deleted.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    #debugger
    @todo = Todo.new(todo_params)
    @todo.save
---
INSERT INTO "todos" ("item", "created_at", "updated_at") VALUES (?, ?, ?)  [["item", "Test"], ["created_at", "2019-12-27 10:50:25.516392"], ["updated_at", "2019-12-27 10:50:25.516392"]]

  def show
    #debugger
    @todo = Todo.with_deleted.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def update
    @todo = Todo.with_deleted.find(params[:id])
    if request.xhr?
      @todo.isCompleted ? @todo.update_attribute(:isCompleted, false) : @todo.update_attribute(:isCompleted, true)
      respond_to do |format|
        #format.html {redirect_to todos_path}
        format.json { render json: {:todo => @todo } }
      end
    else
      if @todo.update(todo_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "todos" SET "isCompleted" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["isCompleted", 1], ["updated_at", "2019-12-24 11:06:44.569510"], ["id", 1]]
UPDATE "todos" SET "isCompleted" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["isCompleted", 1], ["updated_at", "2019-12-17 09:25:13.606610"], ["id", 205]]

  def destroy
    @todo = Todo.find(params[:id])
    @todo.destroy
---
SELECT  "todos".* FROM "todos" WHERE "todos"."deleted_at" IS NOT NULL AND "todos"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "tags_todos" WHERE "tags_todos"."todo_id" = ?  [["todo_id", 15]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 15]]

  def recover
    @todo = Todo.only_deleted.find(params[:id])
    @todo.restore
---
SELECT  "todos".* FROM "todos" WHERE "todos"."deleted_at" IS NOT NULL AND "todos"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "todos" SET "deleted_at" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["deleted_at", nil], ["updated_at", "2019-12-27 09:17:05.569237"], ["id", 12]]

  def purge
    @todo = Todo.only_deleted.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."deleted_at" IS NOT NULL AND "todos"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]