app/controllers/todos_controller.rb

SELECT  "todos".* FROM "todos" WHERE "todos"."deleted_at" IS NOT NULL ORDER BY "todos"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @todos = Todo.all

DELETE FROM "tags_todos" WHERE "tags_todos"."todo_id" = ?  [["todo_id", 210]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 210]]
---
  def destroy
    @todo = Todo.find(params[:id])
    @todo.destroy